"""
Задача №1

Розробити програму-довідник, яка за введеним значенням радіуса r
пропонуватиме користувачу допомогу в обчисленні n (номер послуги): 1 -
довжини кола, 2 - площі круга, 3 - об’єму кулі, 4 - площі поверхні
кулі. Дані вводять в такому порядку: r, n.

Автор: Савченко Валентина 31І група
"""

r = float(input("Уведіть значення радіуса кола: "))

print("Оберіть значення, яке ви хочете обчислити (1-довжина кола, 2-площа,3-об*єм кулі, 4-площа поверхні кулі)")

n = int(input("Уведіть цифру від 1 до 4: "))
P = 3.14
if n == 1:
    print(f'Довжина кола з радіусом {r} = {round((2 * r * P), 2)}')
elif n == 2:
    print(f'Площа круга з радіусом {r} = {round(P * r**2, 2)}')
elif n == 3:
    print(f'Об`єм кулі з радіусом {r} = {round((4 * P * r **3)/3, 2)}')
elif n == 4:
    print(f'Площа поверхні кулі з радіусом {r} = {round((4 * P * r**2), 2)}')
else:
    print('Послуги з таким номером немає')
