"""
Задача №2

Дано три цілих числа. Упорядкуйте їх у порядку зростання. Програма
повинна зчитувати три числа a, b, c. Далі програма повинна змінювати їх
значення так, щоб стали виконані умови a ≤ b ≤ c. Результатом роботи
програми буде виведення трійки чисел a, b, c в одному рядку. При
розв’язуванні задачі не можна використовувати додаткові змінні, тобто
єдиною допустимою операцією присвоювання є обмін значень двох змінних
типу (a, b) = (b, a).

Автор: Савченко Валентина 31І група
"""
a = int(input("Уведіть число а: "))
b = int(input("Уведіть число b: "))
c = int(input("Уведіть число c: "))

if a > b:
    a, b = b, a
if b > c:
    b, c = c, b
    
print(a, b, c)
